# 모듈 만들기
## 모듈을 읽어 들이는 흐름
### 모듈: 파일 또는 폴더를 활용해서 구성
# import module_name
# 현재 실행하고 있는 파일이 있는 위치에서 "module_name"이라는
# 파일 또는 폴더가 있는지 확인
# (존재하지 않는다면) 환경 변수에 등록되어 있는 위치에서 확인
# [참고적으로 그래서 "모듈 이름과 같은 이름의 파일"을 만들어서 사용하시면 오류가 발생합니다.
# (ex) """math 모듈 살펴보니까 파일 math.py로 만들어야지"""하시는 경우가 있는데 그러면 오류납니다.
# 다름 이름으로 만들어서 공부해주세요]
# 현재 파일의 디렉토리 -> 환경변수 -> 내장 모듈 -> 외부 모듈

# 이 두 모듈은 현재 파이썬 코드의 디렉토리에 존재하지 않고 내장 모듈에 있다.
# import sys
# import math

# 환경변수에 어떠한 위치가 기록되어 있는지 확인 가능
# print(sys.path)  # -> 경로에 들어가면 지금까지 살펴보았던 모듈 확인 가능
# 각 경로를 터미널에 open 경로 쳐서 확인해봐라.

## 모듈 만들기
### 간단한 파일과 간단한 폴더를 활용해서 모듈을 만들어보자.
